CSI API ETABS v1

# cSapModelPropFrame Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropFrame PropFrame { get; }

    ReadOnly Property PropFrame As cPropFrame
    	Get

    Dim instance As cSapModel
    Dim value As cPropFrame

    value = instance.PropFrame

    property cPropFrame^ PropFrame {
    	cPropFrame^ get ();
    }

    abstract PropFrame : cPropFrame with get

#### Property Value

Type: cPropFrame

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com